app/views/users/show.html.erb

			<div class = "course_thumb"><%= image_tag course.image_url(:thumb).to_s %>
				<p>Taught by <%= course.user.firstname %></p></div>
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1