app/views/courses/_feed_item.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    <span class="user">
      <%= link_to feed_item.user.firstname, feed_item.user %><%= " posted "%>