app/views/courses/_unenroll.html.erb

SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`user_id` = 1 AND `enrollments`.`course_id` = 2 LIMIT 1
---
<%= form_for current_user.enrollments.find_by_course_id(@course), :html => { :method => :delete } do |f| %>