app/views/courses/show.html.erb

SELECT COUNT(*) FROM `enrollments` WHERE `enrollments`.`course_id` = 2
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`course_id` = 1
---
			<li class="bottle">Class Size <span><%=@course.attendance%></span></li>
			<li>Signed Up <em></em><span><%=@course.enrollments.count%></span></li>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
	<br></br>
	<%= link_to @course.user.firstname + '\'s', @course.user%> Course