app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses` WHERE `courses`.`state` = 'TN' ORDER BY courses.created_at DESC
SELECT `courses`.* FROM `courses` ORDER BY courses.created_at DESC
---
  def index
    state = params[:state]
    if (params[:state])
      @courses = Course.where(:state => state)
    elsif current_user
      @courses = Course.where(:state => current_user.state)
    else
      @courses = Course.all

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 5 ORDER BY courses.created_at DESC LIMIT 1
---
  def show
    @course = Course.find(params[:id])

INSERT INTO `courses` (`attendance`, `category`, `city`, `cost`, `created_at`, `credentials`, `description`, `enddate`, `endtime`, `image`, `name`, `place`, `startdate`, `starttime`, `state`, `updated_at`, `user_id`, `zipcode`) VALUES (3, 'Engineering', 'Nashville', 3, '2011-12-29 07:04:12', 'asdfdfa', 'adsfafsda', '2011-12-29', '2011-12-29 08:03:00', 'railslion.png', 'dsafadf', 'adsfasd', '2011-12-29', '2011-12-29 07:03:00', 'AZ', '2011-12-29 07:04:12', 1, '22222')
---
  def create
    @course = Course.new(params[:course])
    @course.user_id = current_user.id
    current_user.teach!(@course, current_user)
    if @course.save

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 5 ORDER BY courses.created_at DESC LIMIT 1
---
  def edit
    @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 5 ORDER BY courses.created_at DESC LIMIT 1
UPDATE `courses` SET `description` = 'ASDSAdadsfsgdf', `updated_at` = '2011-12-20 05:25:02' WHERE `courses`.`id` = 1
---
  def update
    @course = Course.find(params[:id])
    if @course.update_attributes(params[:course])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 5 ORDER BY courses.created_at DESC LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 1
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy