app/controllers/enrollments_controller.rb

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 ORDER BY courses.created_at DESC LIMIT 1
SELECT COUNT(*) FROM `enrollments` WHERE `enrollments`.`course_id` = 1
---
  def create
    @course = Course.find(params[:enrollment][:course_id])
    enrollments = @course.enrollments.count

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 2 ORDER BY courses.created_at DESC LIMIT 1
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`id` = 1 LIMIT 1
---
  def destroy
    @course = Enrollment.find(params[:id]).course