app/controllers/users_controller.rb

  def show
    @title = @user.id
    @enrollments = @user.enrollments
    @courses = Course.find(:all, :conditions => [ "user_id IN (?)", current_user.id], :limit => 50)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 ORDER BY courses.created_at DESC LIMIT 1

  def find_user
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def dashboard
    @title = "Dashboard"
    if user_signed_in?
    @feed_items = current_user.feed
    end
    @enrollments = current_user.enrollments
    @user = current_user
    @courses = Course.find(:all, :conditions => [ "user_id IN (?)", current_user.id], :limit => 50)
---
SELECT `courses`.* FROM `courses` WHERE `courses`.`user_id` = 1 ORDER BY courses.created_at DESC LIMIT 1
SELECT `enrollments`.* FROM `enrollments` WHERE `enrollments`.`course_id` = 1